
&НаСервере
Функция ПолучитьДеталиРаботы(Работа)
  РаботаОбъект = Работа.ПолучитьОбъект();
  
  МассивДеталей = Новый Массив;
  
  Для Каждого СтрокаСпецификации Из РаботаОбъект.СпецификацияМатериалов Цикл
  	СтруктураДетали = Новый Структура;
  	СтруктураДетали.Вставить("Автодеталь", СтрокаСпецификации.Автодеталь);
  	СтруктураДетали.Вставить("Количество", СтрокаСпецификации.Количество);
  	
  	МассивДеталей.Добавить(СтруктураДетали);  
  КонецЦикла;
  Возврат МассивДеталей;
КонецФункции

&НаКлиенте
Процедура РаботыРаботаПриИзменении(Элемент)
  СтрокаТабличнойЧасти = Элементы.Работы.ТекущиеДанные;
  Детали = ПолучитьДеталиРаботы(СтрокаТабличнойЧасти.Работа);
  Для Каждого СтрокаДетали Из Детали Цикл
  	НоваяСтрока = Объект.Автодетали.Добавить();
  	НоваяСтрока.Автодеталь = СтрокаДетали.Автодеталь;
  	НоваяСтрока.Количество = СтрокаДетали.Количество;
  	НоваяСтрока.СсылкаНаРаботу = СтрокаТабличнойЧасти.Работа;
  КонецЦикла;
  
  Сообщить(Детали.Количество());
КонецПроцедуры

&НаКлиенте
Процедура РаботыПриАктивизацииСтроки(Элемент)
	//TODO: Вставить содержимое обработчика
КонецПроцедуры
&НаСервере
Функция РассчитатьНормаЧасы(Работа, Количество)
	РаботаОбъект = Работа.ПолучитьОбъект();
	Возврат РаботаОбъект.НормаЧас * Количество
КонецФункции


&НаКлиенте
Процедура РаботыКоличествоПриИзменении(Элемент)
	СтрокаТабличнойЧасти = Элементы.Работы.ТекущиеДанные;
	СтрокаТабличнойЧасти.НормаЧас = РассчитатьНормаЧасы(СтрокаТабличнойЧасти.Работа, СтрокаТабличнойЧасти.Количество)
КонецПроцедуры
