//НЕ РАБОТАЕТ ВОВА СДЕЛАЙ ТАК ЧТОБЫ РАБОТАЛО
&НаКлиенте 
Процедура РаботыПередУдалением(Элемент, Отказ)
	СтрокаТабличнойЧасти = Элементы.Работы.ТекущиеДанные;
	Для Каждого СтрокаАвто Из Объект.Автодетали Цикл
        Если СтрокаАвто.СсылкаНаРаботу = СтрокаТабличнойЧасти.Работа Тогда
            Объект.Автодетали.Удалить(СтрокаАвто);
        КонецЕсли;
    КонецЦикла;
КонецПроцедуры

&НаСервере
Функция ПолучитьДеталиРаботыСУчетомКоличество(Работа, КоличествоРабот)
    Если Работа = Неопределено Или Работа.Пустая() Тогда
        Возврат Новый Массив;
    КонецЕсли;
    РаботаОбъект = Работа.ПолучитьОбъект();
    МассивДеталей = Новый Массив;
    Для Каждого СтрокаСпец Из РаботаОбъект.СпецификацияМатериалов Цикл
        СтруктураДетали = Новый Структура;

        СтруктураДетали.Вставить("Автодеталь", СтрокаСпец.Автодеталь);
        СтруктураДетали.Вставить("Количество", СтрокаСпец.Количество * КоличествоРабот);

        МассивДеталей.Добавить(СтруктураДетали);
    КонецЦикла;

    Возврат МассивДеталей;

КонецФункции

&НаКлиенте
Процедура РаботыРаботаПриИзменении(Элемент)
  РаботыПриАктивизацииСтроки(Элемент);
  СтрокаТабличнойЧасти = Элементы.Работы.ТекущиеДанные;
  КоличествоРабот = СтрокаТабличнойЧасти.Количество;
  Детали = ПолучитьДеталиРаботыСУчетомКоличество(СтрокаТабличнойЧасти.Работа,КоличествоРабот );
  
  Для Каждого СтрокаДетали Из Детали Цикл
  	НоваяСтрока = Объект.Автодетали.Добавить();
  	НоваяСтрока.Автодеталь = СтрокаДетали.Автодеталь;
  	НоваяСтрока.Количество = СтрокаДетали.Количество;
  	НоваяСтрока.СсылкаНаРаботу = СтрокаТабличнойЧасти.Работа;
  КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура РаботыПриАктивизацииСтроки(Элемент)
    СтрокаРаботы = Элементы.Работы.ТекущиеДанные;
    Если СтрокаРаботы = Неопределено Или СтрокаРаботы.Работа = Неопределено Тогда
     	Элементы.Автодетали.ОтборСтрок = Неопределено;
     	Элементы.Автодетали.Обновить();
     	Возврат
    КонецЕсли;
    Элементы.Автодетали.ОтборСтрок = Новый ФиксированнаяСтруктура("СсылкаНаРаботу", СтрокаРаботы.Работа);
    Элементы.Автодетали.Обновить();
КонецПроцедуры

&НаСервере
Функция РассчитатьНормаЧасы(Работа, Количество)
	РаботаОбъект = Работа.ПолучитьОбъект();
	Возврат РаботаОбъект.НормаЧас * Количество
КонецФункции


&НаКлиенте
Процедура РаботыКоличествоПриИзменении(Элемент)
	СтрокаТабличнойЧасти = Элементы.Работы.ТекущиеДанные;
	СтрокаТабличнойЧасти.НормаЧас = РассчитатьНормаЧасы(СтрокаТабличнойЧасти.Работа, СтрокаТабличнойЧасти.Количество);
    НовыеДетали = ПолучитьДеталиРаботыСУчетомКоличество(
        СтрокаТабличнойЧасти.Работа,
        СтрокаТабличнойЧасти.Количество
    );
    Для Каждого СтрокаАвто Из Объект.Автодетали Цикл
        Если СтрокаАвто.СсылкаНаРаботу = СтрокаТабличнойЧасти.Работа Тогда
            Для Каждого Д Из НовыеДетали Цикл
                Если Д.Автодеталь = СтрокаАвто.Автодеталь Тогда
                    СтрокаАвто.Количество = Д.Количество;
                КонецЕсли
            КонецЦикла;

        КонецЕсли;
    КонецЦикла;
КонецПроцедуры


