
&НаСервере
Процедура ПечатьЧекаНаСервере(ТабДок)
	
	Макет = Документы.Калькуляция.ПолучитьМакет("Макет");
	ОбластьСертификат = Макет.ПолучитьОбласть("МакетОтчета");
	ТабДок.Очистить();
	ИмяКлиента = Объект.Клиент.ФИОКонтактногоЛица;
	Дата = Объект.Дата;
	Автомобиль = Объект.Автомобиль.Наименование;
	ОбластьСертификат.Параметры.ИмяКлиента = ИмяКлиента;
	ОбластьСертификат.Параметры.Дата = Дата;
	ОбластьСертификат.Параметры.Автомобиль = Автомобиль;
	ТабДок.Вывести(ОбластьСертификат);

КонецПроцедуры

&НаКлиенте
Процедура ПечатьЧека(Команда)
	ТабДок = Новый ТабличныйДокумент();
	ПечатьЧекаНаСервере(ТабДок);
	ТабДок.Показать();
КонецПроцедуры

&НаСервере
Функция ПолучитьЦену(Материал)
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	СтоимостьМатериалов.Материал,
	|	СтоимостьМатериалов.Стоимость
	|ИЗ
	|	РегистрСведений.СтоимостьМатериалов КАК СтоимостьМатериалов
	|ГДЕ
    |   СтоимостьМатериалов.Материал = &Материал";
    Запрос.УстановитьПараметр(
        "Материал", Материал    
    );
    РезультатЗапроса = Запрос.Выполнить();
    Записи = РезультатЗапроса.Выбрать();
    Пока Записи.Следующий() Цикл
        Возврат Записи.Стоимость;
    КонецЦикла;
КонецФункции

&НаКлиенте
Процедура АвтодеталиМатериал3ПриИзменении(Элемент)
	Материал = Элементы.Автодетали.ТекущиеДанные.Материал3;
	Количество = Элементы.Автодетали.ТекущиеДанные.Количество;
	Цена = ПолучитьЦену(Материал);
	Элементы.Автодетали.ТекущиеДанные.Цена3 = Цена;
	Элементы.Автодетали.ТекущиеДанные.Сумма3 = Цена*Количество;
КонецПроцедуры

&НаКлиенте
Процедура АвтодеталиМатериал2ПриИзменении(Элемент)
	Материал = Элементы.Автодетали.ТекущиеДанные.Материал2;
	Количество = Элементы.Автодетали.ТекущиеДанные.Количество;
	Цена = ПолучитьЦену(Материал);
	Элементы.Автодетали.ТекущиеДанные.Цена2 = Цена;
	Элементы.Автодетали.ТекущиеДанные.Сумма2 = Цена*Количество;
КонецПроцедуры

&НаКлиенте
Процедура АвтодеталиМатериал1ПриИзменении(Элемент)
	Материал = Элементы.Автодетали.ТекущиеДанные.Материал1;
	Количество = Элементы.Автодетали.ТекущиеДанные.Количество;
	Цена = ПолучитьЦену(Материал);
	Элементы.Автодетали.ТекущиеДанные.Цена1 = Цена;
	Элементы.Автодетали.ТекущиеДанные.Сумма1 = Цена*Количество;
КонецПроцедуры

&НаКлиенте 
Процедура РаботыПередУдалением(Элемент, Отказ)
	СтрокаТабличнойЧасти = Элементы.Работы.ТекущиеДанные;
	КолВо = Объект.Автодетали.Количество()-1; 
	ИндексСтроки = КолВо; 
	Для Счетчик = 0 по КолВо Цикл 
		Запись = Объект.Автодетали.Получить(ИндексСтроки); 
		Если Запись.СсылкаНаРаботу=СтрокаТабличнойЧасти.Работа тогда 
			Объект.Автодетали.Удалить(Запись);
		КонецЕсли;
		ИндексСтроки = ИндексСтроки - 1; 
	КонецЦикла;
КонецПроцедуры

&НаСервере
Функция ПолучитьДеталиРаботыСУчетомКоличество(Работа, КоличествоРабот)
    Если Работа = Неопределено Или Работа.Пустая() Тогда
        Возврат Новый Массив;
    КонецЕсли;
    РаботаОбъект = Работа.ПолучитьОбъект();
    МассивДеталей = Новый Массив;
    Для Каждого СтрокаСпец Из РаботаОбъект.СпецификацияМатериалов Цикл
        СтруктураДетали = Новый Структура;

        СтруктураДетали.Вставить("Автодеталь", СтрокаСпец.Автодеталь);
        СтруктураДетали.Вставить("Количество", СтрокаСпец.Количество * КоличествоРабот);

        МассивДеталей.Добавить(СтруктураДетали);
    КонецЦикла;

    Возврат МассивДеталей;

КонецФункции

&НаКлиенте
Процедура УдалитьДеталиПриИзмененииРаботы()
	КолВо = Объект.Автодетали.Количество()-1; 
	ИндексСтроки = КолВо; 
	Для Счетчик = 0 по КолВо Цикл 
		Запись = Объект.Автодетали.Получить(ИндексСтроки);
		ДетальНаУдаление = Истина;
		Для Каждого СтрокаРабота Из Объект.Работы Цикл
			Если Запись.СсылкаНаРаботу=СтрокаРабота.Работа Тогда
				ДетальНаУдаление = Ложь;
				Прервать;
			КонецЕсли;
		КонецЦикла;
		Если ДетальНаУдаление Тогда
			Объект.Автодетали.Удалить(Запись);
		КонецЕсли;
		ИндексСтроки = ИндексСтроки - 1; 
	КонецЦикла;
	Сообщить("Деталей перед добавлением новых " + Объект.Автодетали.Количество());
КонецПроцедуры

&НаКлиенте
Процедура РаботыРаботаПриИзменении(Элемент)
  РаботыПриАктивизацииСтроки(Элемент);
  СтрокаТабличнойЧасти = Элементы.Работы.ТекущиеДанные;
  КоличествоРабот = СтрокаТабличнойЧасти.Количество;
  Детали = ПолучитьДеталиРаботыСУчетомКоличество(СтрокаТабличнойЧасти.Работа,КоличествоРабот );
  
  УдалитьДеталиПриИзмененииРаботы();
  
  Для Каждого СтрокаДетали Из Детали Цикл
  	НоваяСтрока = Объект.Автодетали.Добавить();
  	НоваяСтрока.Автодеталь = СтрокаДетали.Автодеталь;
  	НоваяСтрока.Количество = СтрокаДетали.Количество;
  	НоваяСтрока.СсылкаНаРаботу = СтрокаТабличнойЧасти.Работа;
  КонецЦикла;

КонецПроцедуры

&НаКлиенте
Процедура РаботыПриАктивизацииСтроки(Элемент)
    СтрокаРаботы = Элементы.Работы.ТекущиеДанные;
    Если СтрокаРаботы = Неопределено Или СтрокаРаботы.Работа = Неопределено Тогда
     	Элементы.Автодетали.ОтборСтрок = Неопределено;
     	Элементы.Автодетали.Обновить();
     	Возврат
    КонецЕсли;
    Элементы.Автодетали.ОтборСтрок = Новый ФиксированнаяСтруктура("СсылкаНаРаботу", СтрокаРаботы.Работа);
    Элементы.Автодетали.Обновить();
КонецПроцедуры

&НаСервере
Функция РассчитатьНормаЧасы(Работа, Количество)
	РаботаОбъект = Работа.ПолучитьОбъект();
	Возврат РаботаОбъект.НормаЧас * Количество
КонецФункции


&НаКлиенте
Процедура РаботыКоличествоПриИзменении(Элемент)
	СтрокаТабличнойЧасти = Элементы.Работы.ТекущиеДанные;
	СтрокаТабличнойЧасти.НормаЧас = РассчитатьНормаЧасы(СтрокаТабличнойЧасти.Работа, СтрокаТабличнойЧасти.Количество);
    НовыеДетали = ПолучитьДеталиРаботыСУчетомКоличество(
        СтрокаТабличнойЧасти.Работа,
        СтрокаТабличнойЧасти.Количество
    );
    Для Каждого СтрокаАвто Из Объект.Автодетали Цикл
        Если СтрокаАвто.СсылкаНаРаботу = СтрокаТабличнойЧасти.Работа Тогда
            Для Каждого Д Из НовыеДетали Цикл
                Если Д.Автодеталь = СтрокаАвто.Автодеталь Тогда
                    СтрокаАвто.Количество = Д.Количество;
                    Если СтрокаАвто.Материал1 <> Неопределено Тогда
                    	СтрокаАвто.Сумма1 = СтрокаАвто.Цена1 * Д.Количество;
                    КонецЕсли;
                    
                    Если СтрокаАвто.Материал2 <> Неопределено Тогда
                    	СтрокаАвто.Сумма2 = СтрокаАвто.Цена2 * Д.Количество;
                    КонецЕсли;
                    
                    Если СтрокаАвто.Материал3 <> Неопределено Тогда
                    	СтрокаАвто.Сумма3 = СтрокаАвто.Цена3 * Д.Количество;
                    КонецЕсли;
                    
                КонецЕсли
            КонецЦикла;

        КонецЕсли;
    КонецЦикла;
КонецПроцедуры


